app/views/top/index.html.erb

                    <span>
                    <%= blog.blog_detail.title if blog.blog_detail.title.present?%>
---
SELECT  "blog_details".* FROM "blog_details" WHERE "blog_details"."blog_id" = $1 LIMIT $2  [["blog_id", 7], ["LIMIT", 1]]

                      <ul class="top_blog_tag">
                        <% blog.hashtags.each do |hash_tag| %>
---
SELECT "hashtags".* FROM "hashtags" INNER JOIN "blog_hashtags" ON "hashtags"."id" = "blog_hashtags"."hashtag_id" WHERE "blog_hashtags"."blog_id" = $1  [["blog_id", 7]]