app/views/experience/index.html.erb

          <div class="ex_main_left">
            <% if @hot_exp.present? && @hot_exp.experience_detail.present? %>
---
SELECT  "experiences".* FROM "experiences" ORDER BY "experiences"."created_at" DESC LIMIT $1  [["LIMIT", 1]]