app/controllers/blog_controller.rb

SELECT COUNT(*) FROM (SELECT  DISTINCT "blogs".* FROM "blogs" ORDER BY "blogs"."created_at" DESC LIMIT $1 OFFSET $2) subquery_for_count  [["LIMIT", 3], ["OFFSET", 0]]
SELECT  "blogs".* FROM "blogs" ORDER BY "blogs"."created_at" DESC LIMIT $1  [["LIMIT", 1]]
SELECT "categories".* FROM "categories"
SELECT "locations".* FROM "locations"
SELECT  "blog_details".* FROM "blog_details" WHERE "blog_details"."blog_id" = $1 LIMIT $2  [["blog_id", 7], ["LIMIT", 1]]
SELECT  DISTINCT "blogs".* FROM "blogs" ORDER BY "blogs"."created_at" DESC LIMIT $1 OFFSET $2  [["LIMIT", 3], ["OFFSET", 0]]
---
  def index
    # breadcrumb
    add_breadcrumb 'Blog', :blog_index_path
    @blogs = Blog.all.order(created_at: :DESC).page(params[:page]).per(3)
    @blog_first = Blog.all.order(created_at: :DESC).first

    @popular_blogs = Blog.popular
    @categories = Category.all
    @locations = Location.all
    @hashtags = Hashtag.all

    @search = Blog.ransack(params[:q])
    @search.sorts = 'blog_details.title desc' if @search.sorts.empty?
    @blogs = @search.result(distinct: true).order(created_at: :DESC).page(params[:page]).per(3)