app/controllers/experience_controller.rb

SELECT COUNT(*) FROM (SELECT  DISTINCT "experiences".* FROM "experiences" ORDER BY "experiences"."created_at" DESC LIMIT $1 OFFSET $2) subquery_for_count  [["LIMIT", 6], ["OFFSET", 0]]
SELECT  "experiences".* FROM "experiences" ORDER BY "experiences"."created_at" DESC LIMIT $1  [["LIMIT", 1]]
SELECT COUNT(*) FROM "experiences"
SELECT  DISTINCT "experiences".* FROM "experiences" ORDER BY "experiences"."created_at" DESC LIMIT $1 OFFSET $2  [["LIMIT", 6], ["OFFSET", 0]]
---
  def index
    add_breadcrumb 'Experience', :experience_index_path
    @experiences = Experience.all.order(updated_at: :DESC).page(params[:page]).per(6)
    @experience_first = Experience.all.order(created_at: :DESC).first
    @experience_count = Experience.count
    @page = params[:pagenum].to_i
    @last_page = @experiences.total_pages

    @search = Experience.ransack(params[:q])
    @categories = CategoryService.new.call
    @locations = LocationService.new.call
    @search.sorts = 'experience_details.title desc' if @search.sorts.empty?
    @experiences = @search.result(distinct: true).order(created_at: :DESC).page(params[:page]).per(6)

SELECT  "experiences".* FROM "experiences" WHERE "experiences"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def show
    @experience = Experience.find(params[:id])