app/controllers/top_controller.rb

SELECT  "blogs".* FROM "blogs" ORDER BY "blogs"."impressions_count" DESC LIMIT $1  [["LIMIT", 3]]
---
  def index
    @bl_im1 = Blog.all.order(impressions_count: :DESC).first