app/views/blog/index.html.erb

              <span class="blog_main_left_tag">
                <% @blog_first.categories.each do |category| %>
---
SELECT "categories".* FROM "categories" INNER JOIN "category_blogs" ON "categories"."id" = "category_blogs"."category_id" WHERE "category_blogs"."blog_id" = $1  [["blog_id", 7]]

                  <ul class="tag_list">
                    <% @blog_first.hashtags.each do |hash_tag| %>
---
SELECT "hashtags".* FROM "hashtags" INNER JOIN "blog_hashtags" ON "hashtags"."id" = "blog_hashtags"."hashtag_id" WHERE "blog_hashtags"."blog_id" = $1  [["blog_id", 7]]

              <div class="pic" style="background: url(<%= image_url("common/sample_pic.jpg") %>) center center no-repeat;background-size: cover;">
                <% if blog.categories.any? %>
                  <span class="blog_main_left_tag">
                    <%unless blog.categories.first.nil? %>
                      <%= blog.categories.first.category_name %>
---
SELECT  1 AS one FROM "categories" INNER JOIN "category_blogs" ON "categories"."id" = "category_blogs"."category_id" WHERE "category_blogs"."blog_id" = $1 LIMIT $2  [["blog_id", 7], ["LIMIT", 1]]
SELECT  "categories".* FROM "categories" INNER JOIN "category_blogs" ON "categories"."id" = "category_blogs"."category_id" WHERE "category_blogs"."blog_id" = $1 ORDER BY "categories"."id" ASC LIMIT $2  [["blog_id", 5], ["LIMIT", 1]]


          <% if blog.categories.any? %>
            <span class="blog_main_left_tag">
            <% if !blog.categories.first.nil? %>
              <%= blog.categories.first.category_name %>
---
SELECT  1 AS one FROM "categories" INNER JOIN "category_blogs" ON "categories"."id" = "category_blogs"."category_id" WHERE "category_blogs"."blog_id" = $1 LIMIT $2  [["blog_id", 7], ["LIMIT", 1]]
SELECT  "categories".* FROM "categories" INNER JOIN "category_blogs" ON "categories"."id" = "category_blogs"."category_id" WHERE "category_blogs"."blog_id" = $1 ORDER BY "categories"."id" ASC LIMIT $2  [["blog_id", 5], ["LIMIT", 1]]

            <ul class="tag_list">
              <% blog.hashtags.each do |hash_tag| %>
---
SELECT "hashtags".* FROM "hashtags" INNER JOIN "blog_hashtags" ON "hashtags"."id" = "blog_hashtags"."hashtag_id" WHERE "blog_hashtags"."blog_id" = $1  [["blog_id", 4]]