app/models/blog.rb

  scope :popular, -> {order(impressions_count: :DESC).take(3)}
---
SELECT  "blogs".* FROM "blogs" ORDER BY "blogs"."impressions_count" DESC LIMIT $1  [["LIMIT", 3]]